# Використання офіційного образу Python 3.10
FROM python:3.10-slim

# Встановлення робочої директорії в контейнері
WORKDIR /app

# Копіювання файлу вимог до залежностей
COPY requirements.txt .

# Встановлення залежностей без збереження кешу для зменшення розміру образу
RUN pip install --no-cache-dir -r requirements.txt

# Копіювання усіх інших файлів проекту в робочу директорію
COPY . /app

# Вказівка на те, що контейнер буде слухати порт 8000
EXPOSE 8000

# Команда, що виконуватиметься при запуску контейнера
CMD ["python", "main.py"]
